Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ2051CA90208.atdf
      <value-group name="SERCOM_SPIM_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="SCK is low when idle" value="0x0"/>
        <value name="IDLE_HIGH" caption="SCK is high when idle" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="USART_CTRLA__TXINV">
        <value name="DISABLE" caption="TxD is not inverted" value="0x0"/>
        <value name="INV" caption="TxD is inverted" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLA__RXINV">
        <value name="DISABLE" caption="RxD is not inverted" value="0x0"/>
        <value name="INV" caption="RxD is inverted" value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLA__SAMPR">
        <value name="ARITHM16X" caption="16x oversampling using arithmetic baud rate generation" value="0x0"/>
        <value name="FRAC16X" caption="16x oversampling using fractional baud rate generation" value="0x1"/>
        <value name="ARITHM8X" caption="8x oversampling using arithmetic baud rate generation" value="0x2"/>
        <value name="FRAC8X" caption="8x oversampling using fractional baud rate generation" value="0x3"/>
        <value name="ARITHM3X" caption="3x oversampling using arithmetic baud rate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM PAD0 is used for data reception" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD1 is used for data reception" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD2 is used for data reception" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD3 is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="PAD[0] = TxD; PAD[1] = XCK" value="0x0"/>
        <value name="PAD2" caption="PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS" value="0x2"/>
        <value name="PAD3" caption="PAD[0] = TxD; PAD[1] = XCK; PAD[2] = TE" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART" caption="USART frame" value="0x0"/>
        <value name="USARTP" caption="USART frame with parity" value="0x1"/>
        <value name="LINBRKGEN" caption="LIN Master Break and Synck generation" value="0x2"/>
        <value name="LINBRKDET" caption="LIN Slave break detection and auto-baud" value="0x4"/>
        <value name="BRKDET" caption="Break detection and auto-baud with parity" value="0x5"/>
        <value name="ISO7816" caption="ISO 7816 Communication" value="0x7"/>
      </value-group>
      <value-group name="USART_CTRLA__CMODE">
        <value name="ASYNC" caption="Asynchronous communication." value="0x0"/>
        <value name="SYNC" caption="Synchronous communication." value="0x1"/>
      </value-group>
      <value-group name="USART_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first." value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first." value="0x1"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLB__AMODE">
        <value name="MASK" caption="The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK" value="0x0"/>
        <value name="2ADDRS" caption="The slave responds to the two unique addresses in ADDR and ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8-bits character" value="0x0"/>
        <value name="9_BIT" caption="9-bits character" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__SSDE">
        <value name="DISABLE" caption="SS low detector is disabled" value="0x0"/>
        <value name="ENABLE" caption="SS low detector is enabled" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__MSSEN">
        <value name="DISABLE" caption="Hardware SS control is disabled" value="0x0"/>
        <value name="ENABLE" caption="Hardware SS control is enabled" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__AMODE">
        <value name="MASK" caption="ADDRMASK is used as a mask to the AADR register" value="0x0"/>
        <value name="2ADDRS" caption="The slave responds to the two unique addresses in ADDR and ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLB__FIFOCLR">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="TXFIFO" caption="Clear TX FIFO" value="0x1"/>
        <value name="RXFIFO" caption="Clear RX FIFO" value="0x2"/>
        <value name="BOTH" caption="Clear both TX and RF FIFOs" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8-bits character" value="0x0"/>
        <value name="9_BIT" caption="9-bits character" value="0x1"/>
        <value name="5_BIT" caption="5-bits character" value="0x5"/>
        <value name="6_BIT" caption="6-bits character" value="0x6"/>
        <value name="7_BIT" caption="7-bits character" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One stop bit" value="0x0"/>
        <value name="2_BIT" caption="Two stop bits" value="0x1"/>
      </value-group>
