Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ2051CA90208.atdf
      <value-group name="CTRLBCLR__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="CTRLBSET__IDXCMD">
        <value name="DISABLE" caption="Command disabled: Index toggles between cycles A and B" value="0"/>
        <value name="SET" caption="Set index: cycle B will be forced in the next cycle" value="1"/>
        <value name="CLEAR" caption="Clear index: cycle A will be forced in the next cycle" value="2"/>
        <value name="HOLD" caption="Hold index: the next cycle will be the same as the current cycle" value="3"/>
      </value-group>
      <value-group name="CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Clear start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force stop" value="2"/>
        <value name="UPDATE" caption="Force update or double buffered registers" value="3"/>
        <value name="READSYNC" caption="Force COUNT read synchronization" value="4"/>
        <value name="DMAOS" caption="One-shot DMA trigger" value="5"/>
      </value-group>
      <value-group name="FCTRLA__SRC">
        <value name="DISABLE" caption="Fault input disabled" value="0"/>
        <value name="ENABLE" caption="MCEx (x=0,1) event input" value="1"/>
        <value name="INVERT" caption="Inverted MCEx (x=0,1) event input" value="2"/>
        <value name="ALTFAULT" caption="Alternate fault (A or B) state at the end of the previous period" value="3"/>
      </value-group>
      <value-group name="FCTRLA__BLANK">
        <value name="START" caption="Blanking applied from start of the ramp" value="0"/>
        <value name="RISE" caption="Blanking applied from rising edge of the output waveform" value="1"/>
        <value name="FALL" caption="Blanking applied from falling edge of the output waveform" value="2"/>
        <value name="BOTH" caption="Blanking applied from each toggle of the output waveform" value="3"/>
      </value-group>
      <value-group name="FCTRLA__HALT">
        <value name="DISABLE" caption="Halt action disabled" value="0"/>
        <value name="HW" caption="Hardware halt action" value="1"/>
        <value name="SW" caption="Software halt action" value="2"/>
        <value name="NR" caption="Non-recoverable fault" value="3"/>
      </value-group>
      <value-group name="FCTRLA__CHSEL">
        <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
        <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
        <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
        <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
      </value-group>
      <value-group name="FCTRLA__CAPTURE">
        <value name="DISABLE" caption="No capture" value="0"/>
        <value name="CAPT" caption="Capture on fault" value="1"/>
        <value name="CAPTMIN" caption="Minimum capture" value="2"/>
        <value name="CAPTMAX" caption="Maximum capture" value="3"/>
        <value name="LOCMIN" caption="Minimum local detection" value="4"/>
        <value name="LOCMAX" caption="Maximum local detection" value="5"/>
        <value name="DERIV0" caption="Minimum and maximum local detection" value="6"/>
        <value name="CAPTMARK" caption="Capture with ramp index as MSB value" value="7"/>
      </value-group>
      <value-group name="FCTRLB__SRC">
        <value name="DISABLE" caption="Fault input disabled" value="0"/>
        <value name="ENABLE" caption="MCEx (x=0,1) event input" value="1"/>
        <value name="INVERT" caption="Inverted MCEx (x=0,1) event input" value="2"/>
        <value name="ALTFAULT" caption="Alternate fault (A or B) state at the end of the previous period" value="3"/>
      </value-group>
      <value-group name="FCTRLB__BLANK">
        <value name="START" caption="Blanking applied from start of the ramp" value="0"/>
        <value name="RISE" caption="Blanking applied from rising edge of the output waveform" value="1"/>
        <value name="FALL" caption="Blanking applied from falling edge of the output waveform" value="2"/>
        <value name="BOTH" caption="Blanking applied from each toggle of the output waveform" value="3"/>
      </value-group>
      <value-group name="FCTRLB__HALT">
        <value name="DISABLE" caption="Halt action disabled" value="0"/>
        <value name="HW" caption="Hardware halt action" value="1"/>
        <value name="SW" caption="Software halt action" value="2"/>
        <value name="NR" caption="Non-recoverable fault" value="3"/>
      </value-group>
      <value-group name="FCTRLB__CHSEL">
        <value name="CC0" caption="Capture value stored in channel 0" value="0"/>
        <value name="CC1" caption="Capture value stored in channel 1" value="1"/>
        <value name="CC2" caption="Capture value stored in channel 2" value="2"/>
        <value name="CC3" caption="Capture value stored in channel 3" value="3"/>
      </value-group>
      <value-group name="FCTRLB__CAPTURE">
        <value name="DISABLE" caption="No capture" value="0"/>
        <value name="CAPT" caption="Capture on fault" value="1"/>
        <value name="CAPTMIN" caption="Minimum capture" value="2"/>
        <value name="CAPTMAX" caption="Maximum capture" value="3"/>
        <value name="LOCMIN" caption="Minimum local detection" value="4"/>
        <value name="LOCMAX" caption="Maximum local detection" value="5"/>
        <value name="DERIV0" caption="Minimum and maximum local detection" value="6"/>
        <value name="CAPTMARK" caption="Capture with ramp index as MSB value" value="7"/>
      </value-group>
      <value-group name="EVCTRL__EVACT0">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or re-trigger counter on event" value="1"/>
        <value name="COUNTEV" caption="Count on event" value="2"/>
        <value name="START" caption="Start counter on event" value="3"/>
        <value name="INC" caption="Increment counter on event" value="4"/>
        <value name="COUNT" caption="Count on active state of asynchronous event" value="5"/>
        <value name="STAMP" caption="Stamp capture" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="EVCTRL__EVACT1">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Re-trigger counter on event" value="1"/>
        <value name="DIR" caption="Direction control" value="2"/>
        <value name="STOP" caption="Stop counter on event" value="3"/>
        <value name="DEC" caption="Decrement counter on event" value="4"/>
        <value name="PWP" caption="Period capture value in CC1 register, pulse width capture value in CC0 register" value="6"/>
        <value name="FAULT" caption="Non-recoverable fault" value="7"/>
      </value-group>
      <value-group name="EVCTRL__CNTSEL">
        <value name="START" caption="An interrupt/event is generated when a new counter cycle starts" value="0"/>
        <value name="END" caption="An interrupt/event is generated when a counter cycle ends" value="1"/>
        <value name="BOUNDARY" caption="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" value="3"/>
      </value-group>
      <value-group name="TCC_WAVE__WAVEGEN">
        <value name="NFRQ" caption="Normal frequency" value="0"/>
        <value name="MFRQ" caption="Match frequency" value="1"/>
        <value name="NPWM" caption="Normal PWM" value="2"/>
        <value name="DPWM" caption="Dual compare PWM" value="3"/>
        <value name="DSCRITICAL" caption="Dual-slope critical" value="4"/>
        <value name="DSBOTTOM" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO" value="5"/>
        <value name="DSBOTH" caption="Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP" value="6"/>
        <value name="DSTOP" caption="Dual-slope with interrupt/event condition when COUNT reaches TOP" value="7"/>
      </value-group>
      <value-group name="WAVE__RAMP">
        <value name="RAMP1" caption="RAMP1 operation" value="0"/>
        <value name="RAMP2A" caption="Alternative RAMP2 operation" value="1"/>
        <value name="RAMP2" caption="RAMP2 operation" value="2"/>
        <value name="RAMP2C" caption="Critical RAMP2 operation" value="3"/>
        <value name="RAMP2CS" caption="Critical Swapped RAMP2 operation" value="4"/>
      </value-group>
    </module>
